<template>
	<div class="extra-newsinfo-container">
		<div class="newsinfo-container">
			<h3 class="title">{{newsInfo.title}}</h3>
			<div class="sub-title">
				<span>发表时间：{{newsInfo.time | dateFormat()}}</span>
				<span>点击 {{newsInfo.clickT}} 次</span>
			</div>
			<hr />
			<p class="content">{{newsInfo.content}}</p>
		</div>
		<comment-box></comment-box>
	</div>
</template>

<script>
	import comment from "../subcomponents/comment.vue";
	
	export default {
		data() {
			return {
				url_id: this.$route.params.id,
				newslists: [{
						id: "0",
						title: "阿里云的工程师要被祭天了？",
						time: Date.now(),
						clickT: 5,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "1",
						title: "你才被祭天了？",
						time: Date.now(),
						clickT: 1,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "2",
						title: "123被祭天了？",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "3",
						title: "4546被祭天了？",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "4",
						title: "放入要被祭天了？",
						time: Date.now(),
						clickT: 1,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "5",
						title: "而师要被祭天了？",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "6",
						title: "阿里云的工程师要被个祭天了",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "7",
						title: "阿尔沟通过被祭天了",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "8",
						title: "阿里云的工程师要被祭天了",
						time: Date.now(),
						clickT: 5,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "9",
						title: "你才被祭天了",
						time: Date.now(),
						clickT: 1,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "10",
						title: "123被祭天了",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "11",
						title: "4546被祭天了",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "12",
						title: "放入要被祭天了",
						time: Date.now(),
						clickT: 1,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "13",
						title: "而师要被祭天了",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "14",
						title: "阿里云的工程师要被个祭天",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
					{
						id: "15",
						title: "阿尔沟通过被祭天",
						time: Date.now(),
						clickT: 0,
						img: "http://img3.duitang.com/uploads/item/201410/02/20141002101507_d5dAx.jpeg",
						content: "那边刚根据美国市场研究机构 Synergy Research Group 的数据，阿里巴巴云计算业务赶超了 IBM，成为全球第四大云基础设施及相关服务的提供商，然后这边的阿里云就挂掉了。昨天下午 16:30 左右，朋友圈、微博等地方受到众多网友的刷屏，原因是纷纷吐槽阿里云控制台访问出现故障，导致官网时好时坏，后台直接登录不上，其中图片服务器也挂掉。▌影响范围受影响的可不止阿里巴巴自家的淘宝天猫，毕竟如今作为全球领先的云计算服务平台，这一故障，直接导致了国内半个互联网瘫痪。对此，不少网友怨声载道：阿里云的函数计算挂了，导致线上故障。打算马上降级到本地计算，结果阿里云的 Kubernetes 也挂了。想着挨个机器手工改一下，发现 OSS 也挂了...整个过程没有报警，因为 SLS 也挂了..."
					},
				],
				newsInfo: []
			}
		},
		created() {
			this.getInfo();
		},
		methods: {
			getInfo() {
				this.newsInfo = this.newslists[this.url_id]
			}
		},
		components: {
  		  // 用来注册子组件的节点
  		  "comment-box": comment
  		}
	}
</script>

<style lang="scss" scoped>
	.extra-newsinfo-container .newsinfo-container {
		padding: 0 10px;
		.title {
			font-size: 16px;
			text-align: center;
			margin: 15px 0;
			color: red;
		}
		.sub-title {
			color: #226aff;
			font-size: 14px;
			display: flex;
			justify-content: space-between;
		}
		.content {
			
		}
	}
</style>